backend: "python"
max_batch_size: 32

input [
  {
    name: "input"
    data_type: TYPE_STRING
    dims: [ -1 ]
  }
]

output [
  {
    name: "output"
    data_type: TYPE_STRING
    dims: [ -1 ]
  }
]

instance_group [
  {
    count: 4
    kind: KIND_GPU
    gpus: [ 0 ]
  }
]

dynamic_batching {
  preferred_batch_size: [ 16, 32 ]
  max_queue_delay_microseconds: 10000
}

parameters {
  key: "PYTHON_BUFFER_SHARED_MEMORY"
  value: { string_value: "104857600" }
}
